README Architecture
